Repository: frncsjrc/SwiftMidiCentral
Catalog: SwiftMidiCentral/Models/Localization/Localizable.xcstrings
Source language: en
Languages: de, fr

# bluetooth.bluetoothDiscoveredDevice
source: Bluetooth did discover MIDI peripheral: %@
de: Bluetooth hat MIDI-Peripheriegerät entdeckt: %@
fr: Bluetooth a découvert le périphérique MIDI : %@

# bluetooth.cannotConnectToUnknownPeripheral
source: Bluetooth cannot connect to unknown peripheral with ID: %@
de: Bluetooth kann keine Verbindung zum unbekannten Peripheriegerät mit ID herstellen: %@
fr: Bluetooth ne peut pas se connecter au périphérique inconnu avec l'ID : %@

source: Bluetooth did connect to %@
de: Bluetooth hat sich mit %@ verbunden
fr: Bluetooth s'est connecté à %@

source: Bluetooth did disconnect from %@
de: Bluetooth hat sich von %@ getrennt
fr: Bluetooth s'est déconnecté de %@

# bluetooth.failedToConnectTo
source: Bluetooth failed to connect to %1$@: %2$@
de: Bluetooth konnte keine Verbindung zu %1$@ herstellen: %2$@
fr: Bluetooth n'a pas pu se connecter à %1$@ : %2$@

# bluetooth.gotDisconnectedFrom
source: Bluetooth got disconnected from %1$@ with error: %2$@
de: Bluetooth wurde von %1$@ getrennt mit Fehler: %2$@
fr: Bluetooth a été déconnecté de %1$@ avec l'erreur : %2$@

source: Bluetooth is not authorized
de: Bluetooth ist nicht autorisiert
fr: Bluetooth n'est pas autorisé

# bluetooth.poweredOff
source: Bluetooth is powered off
de: Bluetooth ist ausgeschaltet
fr: Bluetooth est désactivé

# bluetooth.poweredOn
source: Bluetooth is powered on
de: Bluetooth ist eingeschaltet
fr: Bluetooth est activé

# bluetooth.unavailable
source: Bluetooth is not available
de: Bluetooth ist nicht verfügbar
fr: Bluetooth n'est pas disponible

# bluetooth.unknownError
source: Unknown Bluetooth error
de: Unbekannter Bluetooth-Fehler
fr: Erreur Bluetooth inconnue

# bluetooth.unsupported
source: Bluetooth is not supported
de: Bluetooth wird nicht unterstützt
fr: Bluetooth n'est pas pris en charge

# local.centralCannotConnectToPeripheral
source: Local central cannot connect to unknown peripheral with UUID: %@
de: Lokale Zentrale kann keine Verbindung zum unbekannten Peripheriegerät mit UUID herstellen: %@
fr: Échec de connexion entre le central local et le périphérique inconnu dont l'UUID est %@

# local.centralCannotDisconnectFromPeripheral
source: Local central cannot disconnect from unknown peripheral with UUID: %@
de: Lokale Zentrale kann die Verbindung zum unbekannten Peripheriegerät mit UUID nicht trennen: %@
fr: Échec de déconnexion entre le central local et le périphérique inconnu dont l'UUID est %@

# local.managerRefresh
source: Local manager is refreshing
de: Lokaler Manager wird aktualisiert
fr: Le gestionnaire local est en cours de rafraîchissement

# local.unknownSourceName
source: Unknown source name for peripheral: %@
de: Unbekannter Quellenname für Peripheriegerät: %@
fr: Nom de source inconnu pour le périphérique: %@

# local.unsetDestination
source: No destination selected to send packets to
de: Kein Ziel zum Senden von Paketen ausgewählt
fr: Aucune destination vers laquelle envoyer des paquets

source: MIDI manager send error: %@
de: MIDI-Manager-Sendefehler: %@
fr: Erreur d'envoi du gestionnaire MIDI: %@

# midi.messageChannelPressure
source: Channel pressure: channel %1$u, aftertouch %2$u
de: Kanaldruck: Kanal %1$u, Aftertouch %2$u
fr: Channel pressure: canal %1$u, pression %2$u

# midi.messageControlChange
source: Control change: channel %1$u, control %2$u, value %3$u
de: Controller-Änderung: Kanal %1$u, Controller %2$u, Wert %3$u
fr: Control change: canal %1$u, contrôleur %2$u, valeur %3$u

# midi.messageNoteOff
source: Note off: channel %1$u, key %2$u, velocity %3$u
de: Note Aus: Kanal %1$u, Taste %2$u, Anschlagstärke %3$u
fr: Note off: canal %1$u, note %2$u, vitesse %3$u

# midi.messageNoteOn
source: Note on: channel %1$u, key %2$u, velocity %3$u
de: Note Ein: Kanal %1$u, Taste %2$u, Anschlagstärke %3$u
fr: Note on: canal %1$u, note %2$u, vitesse %3$u

# midi.messagePitchBend
source: Pitch bend: channel %1$u, bend %2$u
de: Tonhöhenänderung: Kanal %1$u, Wert %2$u
fr: Pitch bend: canal %1$u, bend %2$u

# midi.messagePolyPressure
source: Poly pressure: channel %1$u, key %2$u, aftertouch %3$u
de: Polyphoner Druck: Kanal %1$u, Taste %2$u, Aftertouch %3$u
fr: Poly pressure: canal %1$u, note %2$u, pression %3$u

# midi.messageProgramChange
source: Program change: channel %1$u, program %2$u
de: Programmwechsel: Kanal %1$u, Programm %2$u
fr: Program change: canal %1$u, programme %2$u

# midi.messageUnknown
source: Unknown message
de: Unbekannte Nachricht
fr: Message inconnu

# midi.messageUnsupported
source: Unsupported message
de: Nicht unterstützte Nachricht
fr: Message non supporté

source: Receive
de: Empfang
fr: Réception

# remote.unknownDevice
source: Unknown device
de: Unbekanntes Gerät
fr: Appareil inconnu

source: Send
de: Sendung
fr: Envoi

source: Setup
de: Einrichtung
fr: Réglages

source: Source
de: Quelle

# view.incomingSourceLabel
source: Source
de: Quelle

# view.incomingTitle
source: Incoming
de: Eingehend
fr: Réception

# view.outgoingDestinationLabel
source: Destination
de: Ziel

# view.outgoingNoDestinationsLabel
source: Please refresh or scan for devices.
de: Bitte aktualisieren oder nach Geräten suchen.
fr: Rechercher ou rafraîchir les périphériques

# view.outgoingSelectDestination
source: Select a destination
de: Wählen Sie ein Ziel
fr: Sélectionner une destination

# view.outgoingTitle
source: Outgoing
de: Ausgehend
fr: Envoi

# view.setupRefresh
source: Refresh
de: Aktualisieren
fr: Rafraîchir

# view.setupStartScanning
source: Start scanning
de: Scannen starten
fr: Rechercher

# view.setupStopScanning
source: Stop scanning
de: Scannen stoppen
fr: Stopper

# view.setupUnknownDestination
source: No destination
de: Kein Ziel
fr: Aucune destination

# view.setupUnknownSource
source: No source
de: Keine Quelle
fr: Aucune source
